Repository: shuzhzh/TreeletHub
Catalog: TreeletHubWatchApp Watch App/Localizable.xcstrings
Source language: en
Languages: zh_hans

# watch.common.cancel
source: Cancel
zh_hans: 取消

# watch.connect.button.connect
source: Connect
zh_hans: 连接

# watch.connect.button.connecting
source: Connecting…
zh_hans: 连接中…

# watch.connect.cached_hint
source: A pairing code is saved on iPhone and ready to reconnect.
zh_hans: iPhone 已缓存配对码，可直接重连。

# watch.connect.connecting
source: Connecting…
zh_hans: 正在连接…

# watch.connect.find_mac
source: Looking for Mac…
zh_hans: 正在查找 Mac…

# watch.connect.intro
source: Enter the 6-digit code from TreeletHub on your Mac. Your iPhone must be nearby — it owns the Mac connection and stays in sync.
zh_hans: 输入 Mac 上 TreeletHub 显示的 6 位配对码。需与 iPhone 联动：由手机连接 Mac，两边状态会同步。

# watch.connect.iphone_hint
source: Keep the TreeletHub iPhone app installed. When iPhone is already connected, this Watch shows the same console.
zh_hans: 请安装并保留 TreeletHub iPhone 应用。若手机已连接 Mac，手表会直接显示同一控制台。

# watch.connect.pin_placeholder
source: Six-digit code
zh_hans: 6 位数字

# watch.connect.title
source: Connect to Mac
zh_hans: 连接 Mac

# watch.console.linked_hint
source: Linked to the same Mac as your iPhone. Changes sync both ways.
zh_hans: 与 iPhone 连接同一台 Mac，状态双向同步。

# watch.error.iphone_unreachable
source: iPhone isn’t reachable right now — request queued. Unlock iPhone nearby if nothing happens.
zh_hans: 暂无法连上 iPhone，请求已排队。若无反应请解锁附近的 iPhone。

# watch.error.open_iphone
source: Open TreeletHub on iPhone once, then try again.
zh_hans: 请先在 iPhone 上打开一次 TreeletHub，再重试。

# watch.error.pin_format
source: Enter a 6-digit pairing code.
zh_hans: 请输入 6 位数字配对码。

# watch.error.session_unsupported
source: WatchConnectivity is unavailable on this device.
zh_hans: 当前设备不支持 WatchConnectivity。

# watch.settings.disconnect
source: Disconnect
zh_hans: 断开连接
